In [32]:
%%HTML
<style>
    body {
        --vscode-font-family: "等距更纱黑体 SC"
    }
</style>

In [ ]:
import pandas as pd

In [ ]:
s1 = pd.Series([10, 20, 30], index = ["a", "b", "c"]) # 从列表创建
s2 = pd.Series({"a" : 10, "b" : 20, "c" : 30}) # 从字典创建

print("s1 is ", s1["a"])
print("s2 is ", s2["b"])

In [ ]:
# 从列表/数组创建
data1 = [
    [1, "煜宇", 23, "广州"],
    [2, "一吸", 26, "深圳"],
    [3, "汤姆", 29, "上海"],
    [4, "阿诺", 32, "北京"]
]

df1 = pd.DataFrame(data1, columns = ["ID", "Name", "Age", "City"])

# 用来对齐中英文字符
# pd.set_option('display.unicode.ambiguous_as_wide', True) # 好像是专门处理特殊符号的……
pd.set_option('display.unicode.east_asian_width', True) # 东亚字符的宽度被视为1个字符

# 这个是居中用的……不是让中文字符对齐用的
#s_df1 = df1.style.set_properties(**{'font-weight': 'normal',}) # 设置属性和下面的设置表格样式之间进行对比·设置属性这一条目有些好像没有作用……

df1_1 = df1.style.set_table_styles(
    [
        {'selector': 'th', 'props': [('text-align', 'center')]}, #实际上这一条不会起到作用·因为表头默认居中
        {'selector': 'td', 'props': [('text-align', 'center')]},
        {'selector': 'th', 'props': [('font-weight', 'normal')]},
        {'selector': 'td', 'props': [('background-color', 'rgba(40,44,52,1)')]},
        {'selector': 'th', 'props': [('background-color', 'rgba(40,44,52,1)')]}
    ]
)

print(df1) # 采用print输出表格可以实现中文字符对齐，但是没办法居中，因为居中必须要用style函数修改·但是用了style函数后仅能用display来输出

display(df1) # 采用display输出表格默认就实现了中文字符对齐效果·但是因为我在这里输入的是df1而不是s_df1·所以目前还有文字没居中以及表头粗体的问题
display(df1_1) # 在对齐后再一次用一个新函数方法来实现取消表头粗体效果·补充说明之给定的表格采用了.set_table_styles的方法后不用再赋值给新的变量·其会更新自身变量内容

print("\n")

data2 = {
    "ID" : [1, 2, 3, 4],
    "Name" : ["alex", "bobe", "timi", "halo"],
    "Age" : [24, 26, 29, 32],
    "City" : ["tianjin", "yunnan", "chongqin", "jiangxi"]
}

df2 = pd.DataFrame(data2)
print(df2)

   ID  Name  Age  City
0   1  煜宇   23  广州
1   2  一吸   26  深圳
2   3  汤姆   29  上海
3   4  阿诺   32  北京

   ID  Name  Age  City
0   1  煜宇   23  广州
1   2  一吸   26  深圳
2   3  汤姆   29  上海
3   4  阿诺   32  北京

   ID  Name  Age      City
0   1  alex   24   tianjin
1   2  bobe   26    yunnan
2   3  timi   29  chongqin
3   4  halo   32   jiangxi

读取表格文件

In [42]:
mypath = r'C:\Users\28221\Desktop\test.xlsx'
mysheet1 = pd.read_excel(mypath)
mysheet2 = mysheet1.style.set_table_styles(
     [
        {'selector': 'td', 'props': [('text-align', 'center')]},
        {'selector': 'th', 'props': [('font-weight', 'normal')]},
        {'selector': 'td', 'props': [('background-color', 'rgba(40,44,52,1)')]},
        {'selector': 'th', 'props': [('background-color', 'rgba(40,44,52,1)')]}
    ]
)

In [43]:
display(mysheet2)